/*
Группировка и сортировка
Подсчитайте количество учеников в каждом классе, а также отсортируйте их по убыванию количества учеников. Принадлежность ученика к конкретному классу вы можете получить из таблицы Student_in_class. В качестве результата необходимо вывести идентификатор класса (поле class) и количество учеников в этом классе.
Для вывода количества учеников используйте псевдоним count.
*/

SELECT class, COUNT(student) AS count FROM Student_in_class
GROUP BY class
ORDER BY count DESC;